*** Settings ***
Resource    resources/common_keywords.robot
Suite Setup    เปิดเว็บ
Suite Teardown    ปิดเว็บ

*** Test Cases ***
ลบบัญชีแบบไม่ขอสำเนาข้อมูล
    เปิดเว็บ
    ไปหน้า Login
    กรอกข้อมูล Login
    กดปุ่ม Login
    ไปหน้าโปรไฟล์ผู้ใช้
    เลือก ไม่รับสำเนาข้อมูล
    กรอกข้อมูลยืนยันการลบ
    ยืนยันลบบัญชี
    ต้องเห็น popup ลบสำเร็จ
    ต้องไม่เห็นส่วนดาวน์โหลดข้อมูล
    ต้องกดปุ่มตกลง
    ต้องเด้งไปหน้า Home
    ปิดเว็บ

ลบบัญชีแบบขอรับสำเนาข้อมูล
    เปิดเว็บ
    ไปหน้า Login
    กรอกข้อมูล Login
    กดปุ่ม Login
    ไปหน้าโปรไฟล์ผู้ใช้
    เลือก รับสำเนาข้อมูล
    กรอกข้อมูลยืนยันการลบ
    ยืนยันลบบัญชี
    ต้องเห็น popup ลบสำเร็จ
    ต้องเห็นส่วนดาวน์โหลดข้อมูล
    ดาวน์โหลดข้อมูลและยืนยัน
    ต้องเด้งไปหน้า Home
    ปิดเว็บ